Revit 2027 API
SpecTypeId.Reference Class
 This class contains constants identifying reference specs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpecTypeId.Reference
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Reference
Public NotInheritable Class Reference
public ref class Reference abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Reference = class end
The SpecTypeId.Reference type exposes the following members.
Properties
Name | Description
FillPattern |  Fill Pattern, in discipline Common.
Image |  Image, in discipline Common.
LoadClassification |  Load Classification, in discipline Electrical.
Material |  Material, in discipline Common.
Top
See Also
Reference
Autodesk.Revit.DB Namespace